Catalogs/Инциденты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>Инциденты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ЗадачиПроектовСтруктура</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Catalog.ЗадачиПроектовСтруктура</xr:Item>
				<xr:Item>Catalog.Инциденты</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПриоритетыИнцидентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инциденты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПланТекущий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ИнцидентыИстория.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ИнцидентыИстория</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОтКого</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кому</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусИнцидента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыИнцидентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Инцидент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инциденты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Инциденты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ФактИтого( Инцидент )
	Возврат УП_Инциденты.ЗакрытыеЧасыПоИнциденту( Инцидент );
КонецФункции
	
&НаКлиенте
Процедура ПересчетОстаткаПлана( )
	КоличествоФакт 		= ФактИтого( Объект.Ссылка );
	КоличествоПлан		= ?(ЗначениеЗаполнено(Объект.КоличествоПланТекущий), Объект.КоличествоПланТекущий, Объект.КоличествоПлан);
	КоличествоОстаток 	= КоличествоПлан - КоличествоФакт;
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьСостояниеИнцидента( Знач Инцидент )
	Возврат ОпределитьСостояниеИнцидента( Инцидент );
КонецФункции

&НаКлиенте
Процедура ОбновитьСостояние( )
	СостояниеИнцидента	= ПолучитьСостояниеИнцидента( Объект );
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИсториюИнцидента(Инцидент  )
	Перем Порядок;
	
	ИсторияИнцидента.Параметры.УстановитьЗначениеПараметра( "Инцидент", Инцидент);
	
	// Порядок.
	Порядок = ИсторияИнцидента.КомпоновщикНастроек.Настройки.Порядок;
	Порядок.ИдентификаторПользовательскойНастройки = "ОсновнойПорядок";
	
	Порядок.Элементы.Очистить();
	
	ЭлементПорядка 						= Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	ЭлементПорядка.Поле 				= Новый ПолеКомпоновкиДанных("Период");
	ЭлементПорядка.ТипУпорядочивания 	= НаправлениеСортировкиКомпоновкиДанных.Возр;
	ЭлементПорядка.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементПорядка.Использование 		= Истина;
	
КонецПроцедуры   

&НаСервереБезКонтекста
Функция ЭтоАвторИнцидента( АвторИнцидента )
	Возврат (АвторИнцидента = ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо);
КонецФункции

&НаСервереБезКонтекста
Функция ПодготовитьПараметры( Инцидент, Поручить )
	 Возврат УП_Инциденты.ПодготовитьПараметрыИнцидента( Инцидент, Поручить );
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьИсториюИнцидента(Объект.Ссылка);
КонецПроцедуры


//&НаКлиенте
//Процедура ПриОткрытииПослеПроверки( ПарамОпов ) Экспорт
//	Если Объект.ФизическоеЛицо.Пустая() Тогда Возврат; КонецЕсли;
//	
//	Элементы.Закрыт.Доступность = ЭтоАвторИнцидента( Объект.ФизическоеЛицо );
//	ОбновитьСостояние();
//	ПересчетОстаткаПлана();
//		
//КонецПроцедуры
	


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//ОписаниеОповещенияОЗавершении = 
	//		Новый ОписаниеОповещения("ПриОткрытииПослеПроверки", ЭтаФорма);
	
	Если Объект.ФизическоеЛицо.Пустая() Тогда
		ПоказатьПредупреждение(, 
		"Не указан ответственный. Укажите физическое лицо у пользователя!", 10);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Элементы.Закрыт.Доступность = ЭтоАвторИнцидента( Объект.ФизическоеЛицо );
	ОбновитьСостояние();
	ПересчетОстаткаПлана();
	
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСобытиеИнцидента( Поручить )
	
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(, "Сохраните инцидент!", 10);
		Возврат;
	КонецЕсли;
	Если Объект.Закрыт Тогда
		ПоказатьПредупреждение(, "Инцидент закрыт!", 10);
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("РегистрСведений.ИнцидентыИстория.ФормаЗаписи", 
				ПодготовитьПараметры( Объект.Ссылка, Поручить), 
				ЭтаФорма);
				
	// если инцидент был новый, то появляется ссылка
	 ОбновитьИсториюИнцидента(Объект.Ссылка);
				
КонецПроцедуры

&НаКлиенте
Процедура Ответить(Команда)
	СформироватьСобытиеИнцидента( Ложь );
КонецПроцедуры

&НаКлиенте
Процедура Поручить(Команда)
	СформироватьСобытиеИнцидента( Истина );
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	ОбновитьСостояние();
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	ОбновитьСостояние();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПланПриИзменении(Элемент)
	ОбновитьСостояние();
	ПересчетОстаткаПлана();
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПланТекущийПриИзменении(Элемент)
	ОбновитьСостояние();
	ПересчетОстаткаПлана();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытПриИзменении(Элемент)
	ОбновитьСостояние();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбновитьСостояниеИнцидента( ТекущийОбъект.Ссылка );
КонецПроцедуры

&НаКлиенте
Процедура ИсторияИнцидентаПриИзменении(Элемент)
	ОбновитьСостояние();
	ПересчетОстаткаПлана();
	
КонецПроцедуры
